# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.18-s082_1 on Thu Jul 11 01:02:01 CEST 2024

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design gpio_controller

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_clock_transition 0.1 [get_clocks clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports rst_n]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[31]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[30]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[29]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[28]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[27]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[26]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[25]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[24]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[23]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[22]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[21]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[20]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[19]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[18]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[17]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[16]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_i[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_dat_o[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[31]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[30]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[29]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[28]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[27]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[26]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[25]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[24]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[23]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[22]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[21]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[20]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[19]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[18]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[17]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[16]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {wb_adr_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports wb_we_i]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports wb_stb_i]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports wb_cyc_i]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports wb_ack_o]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_idr[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_idr[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_idr[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_idr[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_idr[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_idr[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_idr[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_idr[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_idr[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_idr[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_idr[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_idr[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_idr[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_idr[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_idr[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_idr[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_odr[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_odr[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_odr[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_odr[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_odr[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_odr[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_odr[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_odr[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_odr[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_odr[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_odr[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_odr[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_odr[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_odr[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_odr[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {gpio_odr[0]}]
set_wire_load_mode "enclosed"
set_clock_uncertainty -setup 0.01 [get_ports clk]
set_clock_uncertainty -hold 0.01 [get_ports clk]
